; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v8 - type_3 ?v4 - type_1)
 	      (pred_3 ?v6 - object ?v4 - type_1)
	      (pred_1 ?v8 - type_3 ?v7 - type_2)
	      (pred_4 ?v8 - type_3 ?v6 - object ?v7 - type_2))

   (:action op_1
       :parameters  (?v8 - type_3 ?v1 ?v5 - type_1)
       :precondition (and  (pred_2 ?v8 ?v1))
       :effect (and  (pred_2 ?v8 ?v5)
		     (not (pred_2 ?v8 ?v1))))

   (:action op_3
       :parameters (?v8 - type_3 ?v3 - object ?v2 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_3 ?v3 ?v2) (pred_2 ?v8 ?v2) (pred_1 ?v8 ?v7))
       :effect (and (pred_4 ?v8 ?v3 ?v7)
		    (not (pred_3 ?v3 ?v2)) 
		    (not (pred_1 ?v8 ?v7))))

   (:action op_2
       :parameters (?v8 - type_3 ?v3 - object ?v2 - type_1 ?v7 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v3 ?v7) (pred_2 ?v8 ?v2))
       :effect (and (pred_3 ?v3 ?v2)
		    (pred_1 ?v8 ?v7)
		    (not (pred_4 ?v8 ?v3 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_05 obj_04 - type_3
obj_13 obj_14 obj_01 obj_12 - type_2
obj_08 obj_07 obj_03 obj_02 - type_1
obj_09 obj_11 obj_06 obj_10 - object)
(:init
(pred_2 obj_05 obj_07)
(pred_1 obj_05 obj_13)
(pred_1 obj_05 obj_14)
(pred_2 obj_04 obj_02)
(pred_1 obj_04 obj_01)
(pred_1 obj_04 obj_12)
(pred_3 obj_09 obj_07)
(pred_3 obj_11 obj_08)
(pred_3 obj_06 obj_03)
(pred_3 obj_10 obj_03)
)
(:goal
(and
(pred_3 obj_09 obj_02)
(pred_3 obj_11 obj_02)
(pred_3 obj_06 obj_03)
(pred_3 obj_10 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_05 obj_02) (pred_2 obj_04 obj_02))))
  )
)
)

; plan
1. (op_3 obj_05 obj_09 obj_07 obj_14)
   deleted: (pred_3 obj_09 obj_07) (pred_1 obj_05 obj_14)
   added: (pred_4 obj_05 obj_09 obj_14)
   goals met: 1 of 4
2. (op_1 obj_04 obj_02 obj_03)
   deleted: (pred_2 obj_04 obj_02)
   added: (pred_2 obj_04 obj_03)
   goals met: 1 of 4
3. (op_1 obj_05 obj_07 obj_08)
   deleted: (pred_2 obj_05 obj_07)
   added: (pred_2 obj_05 obj_08)
   goals met: 1 of 4
4. (op_3 obj_04 obj_10 obj_03 obj_12)
   deleted: (pred_3 obj_10 obj_03) (pred_1 obj_04 obj_12)
   added: (pred_4 obj_04 obj_10 obj_12)
   goals met: 1 of 4
5. (op_1 obj_04 obj_03 obj_08)
   deleted: (pred_2 obj_04 obj_03)
   added: (pred_2 obj_04 obj_08)
   goals met: 1 of 4
6. (op_3 obj_05 obj_11 obj_08 obj_13)
   deleted: (pred_3 obj_11 obj_08) (pred_1 obj_05 obj_13)
   added: (pred_4 obj_05 obj_11 obj_13)
   goals met: 1 of 4
7. (op_1 obj_05 obj_08 obj_02)
   deleted: (pred_2 obj_05 obj_08)
   added: (pred_2 obj_05 obj_02)
   goals met: 1 of 4
8. (op_2 obj_04 obj_10 obj_08 obj_12)
   deleted: (pred_4 obj_04 obj_10 obj_12)
   added: (pred_3 obj_10 obj_08) (pred_1 obj_04 obj_12)
   goals met: 2 of 4
9. (op_2 obj_05 obj_11 obj_02 obj_13)
   deleted: (pred_4 obj_05 obj_11 obj_13)
   added: (pred_3 obj_11 obj_02) (pred_1 obj_05 obj_13)
   goals met: 3 of 4
10. (op_2 obj_05 obj_09 obj_02 obj_14)
   deleted: (pred_4 obj_05 obj_09 obj_14)
   added: (pred_3 obj_09 obj_02) (pred_1 obj_05 obj_14)
   goals met: 4 of 4
